<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"343fcdc37f40f9479549aff7b38bd21f1c311191533a922dd73d0b36032c2fca","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1412 at https://github.com/cal-itp/data-infra/actions/runs/21651398904","plan_out_hash":"10f2235c0369343b48cff7a7eea46eaa5065f6aa08fd1fc1b9fac11abeccdb7a","plan_hash":"e8f4e914258aeee0164ecf534676849764e66d461151d44ecc0ec0457b134821","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/README.md"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "0BWrfw==" -> (known after apply)
!~      detect_md5hash      = "ne7x+sZ24fTSy8IDTh0gGQ==" -> "different hash"
!~      generation          = 1768344772441661 -> (known after apply)
        id                  = "calitp-composer-dags/README.md"
!~      md5hash             = "ne7x+sZ24fTSy8IDTh0gGQ==" -> (known after apply)
        name                = "dags/README.md"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/dbt_all_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "8kUdyg==" -> (known after apply)
!~      detect_md5hash      = "7oGB3YI3Q8w5/7781yuGFA==" -> "different hash"
!~      generation          = 1769572162127101 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_all_dag.py"
!~      md5hash             = "7oGB3YI3Q8w5/7781yuGFA==" -> (known after apply)
        name                = "dags/dbt_all_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/dbt_daily_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "KEu9OA==" -> (known after apply)
!~      detect_md5hash      = "MQqPD6bFtMB5o8FjggYHiA==" -> "different hash"
!~      generation          = 1769572162105817 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_daily_dag.py"
!~      md5hash             = "MQqPD6bFtMB5o8FjggYHiA==" -> (known after apply)
        name                = "dags/dbt_daily_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "nH7NDA==" -> (known after apply)
!~      detect_md5hash      = "GZR9uXIZYoIDs/Fd/YKBmg==" -> "different hash"
!~      generation          = 1770132591701197 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "GZR9uXIZYoIDs/Fd/YKBmg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "2LKeRQ==" -> (known after apply)
!~      detect_md5hash      = "sSUdEujPDfDoN/HWDv5D2A==" -> "different hash"
!~      generation          = 1770132593212951 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "sSUdEujPDfDoN/HWDv5D2A==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1412](https://github.com/cal-itp/data-infra/actions/runs/21651398904)